keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxDsadc_reg.h
/** \\brief  640, Result Register Auxiliary Filter */
#define DSADC_CH5_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024640u)

/** Alias (User Manual Name) for DSADC_CH5_RESA.
* To use register names with standard convension, please use DSADC_CH5_RESA.
*/
#define	DSADC_RESA5	(DSADC_CH5_RESA)

/** \\brief  630, Result Register Main Filter */
#define DSADC_CH5_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024630u)

/** Alias (User Manual Name) for DSADC_CH5_RESM.
* To use register names with standard convension, please use DSADC_CH5_RESM.
*/
#define	DSADC_RESM5	(DSADC_CH5_RESM)

/** \\brief  650, Time-Stamp Register */
#define DSADC_CH5_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024650u)

/** Alias (User Manual Name) for DSADC_CH5_TSTMP.
* To use register names with standard convension, please use DSADC_CH5_TSTMP.
*/
#define	DSADC_TSTMP5	(DSADC_CH5_TSTMP)

/** \\brief  728, Boundary Select Register */
#define DSADC_CH6_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024728u)

/** Alias (User Manual Name) for DSADC_CH6_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH6_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL6	(DSADC_CH6_BOUNDSEL)

/** \\brief  7A0, Carrier Generator Synchronization Register */
#define DSADC_CH6_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF00247A0u)

/** Alias (User Manual Name) for DSADC_CH6_CGSYNC.
* To use register names with standard convension, please use DSADC_CH6_CGSYNC.
*/
#define	DSADC_CGSYNC6	(DSADC_CH6_CGSYNC)

/** \\brief  708, Demodulator Input Configuration Register */
#define DSADC_CH6_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024708u)

/** Alias (User Manual Name) for DSADC_CH6_DICFG.
* To use register names with standard convension, please use DSADC_CH6_DICFG.
*/
#define	DSADC_DICFG6	(DSADC_CH6_DICFG)

/** \\brief  718, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH6_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024718u)

/** Alias (User Manual Name) for DSADC_CH6_FCFGA.
* To use register names with standard convension, please use DSADC_CH6_FCFGA.
*/
#define	DSADC_FCFGA6	(DSADC_CH6_FCFGA)

/** \\brief  714, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH6_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024714u)

/** Alias (User Manual Name) for DSADC_CH6_FCFGC.
* To use register names with standard convension, please use DSADC_CH6_FCFGC.
*/
#define	DSADC_FCFGC6	(DSADC_CH6_FCFGC)

/** \\brief  710, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH6_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024710u)

/** Alias (User Manual Name) for DSADC_CH6_FCFGM.
* To use register names with standard convension, please use DSADC_CH6_FCFGM.
*/
#define	DSADC_FCFGM6	(DSADC_CH6_FCFGM)

/** \\brief  720, Integration Window Control Register */
#define DSADC_CH6_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024720u)

/** Alias (User Manual Name) for DSADC_CH6_IWCTR.
* To use register names with standard convension, please use DSADC_CH6_IWCTR.
*/
#define	DSADC_IWCTR6	(DSADC_CH6_IWCTR)

/** \\brief  700, Modulator Configuration Register */
#define DSADC_CH6_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024700u)

/** Alias (User Manual Name) for DSADC_CH6_MODCFG.
* To use register names with standard convension, please use DSADC_CH6_MODCFG.
*/
#define	DSADC_MODCFG6	(DSADC_CH6_MODCFG)

/** \\brief  738, Offset Register Main Filter */
#define DSADC_CH6_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024738u)

/** Alias (User Manual Name) for DSADC_CH6_OFFM.
* To use register names with standard convension, please use DSADC_CH6_OFFM.
*/
#define	DSADC_OFFM6	(DSADC_CH6_OFFM)

/** \\brief  7A8, Rectification Configuration Register */
#define DSADC_CH6_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00247A8u)

/** Alias (User Manual Name) for DSADC_CH6_RECTCFG.
* To use register names with standard convension, please use DSADC_CH6_RECTCFG.
*/
#define	DSADC_RECTCFG6	(DSADC_CH6_RECTCFG)

/** \\brief  740, Result Register Auxiliary Filter */
#define DSADC_CH6_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024740u)

/** Alias (User Manual Name) for DSADC_CH6_RESA.
* To use register names with standard convension, please use DSADC_CH6_RESA.
*/
#define	DSADC_RESA6	(DSADC_CH6_RESA)

/** \\brief  730, Result Register Main Filter */
#define DSADC_CH6_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024730u)

/** Alias (User Manual Name) for DSADC_CH6_RESM.
* To use register names with standard convension, please use DSADC_CH6_RESM.
*/
#define	DSADC_RESM6	(DSADC_CH6_RESM)

/** \\brief  750, Time-Stamp Register */
#define DSADC_CH6_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024750u)

/** Alias (User Manual Name) for DSADC_CH6_TSTMP.
* To use register names with standard convension, please use DSADC_CH6_TSTMP.
*/
#define	DSADC_TSTMP6	(DSADC_CH6_TSTMP)

/** \\brief  828, Boundary Select Register */
#define DSADC_CH7_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024828u)

/** Alias (User Manual Name) for DSADC_CH7_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH7_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL7	(DSADC_CH7_BOUNDSEL)

/** \\brief  8A0, Carrier Generator Synchronization Register */
#define DSADC_CH7_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF00248A0u)

/** Alias (User Manual Name) for DSADC_CH7_CGSYNC.
* To use register names with standard convension, please use DSADC_CH7_CGSYNC.
*/
#define	DSADC_CGSYNC7	(DSADC_CH7_CGSYNC)

/** \\brief  808, Demodulator Input Configuration Register */
#define DSADC_CH7_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024808u)

/** Alias (User Manual Name) for DSADC_CH7_DICFG.
* To use register names with standard convension, please use DSADC_CH7_DICFG.
*/
#define	DSADC_DICFG7	(DSADC_CH7_DICFG)

